---
kind: method
id: M:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Clear
source: html/63e84ccf-746f-2d38-c857-2f5c90d6db0f.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Clear Method

Removes every DistributionSys type from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```